export const PHOTOS_COUNT = 25;

export const PHOTO_IDS_RANGE = {
  MIN: 1,
  MAX: 25,
};

export const URLS_RANGE = {
  MIN: 1,
  MAX: 25,
};

export const LIKES_RANGE = {
  MIN: 15,
  MAX: 200,
};

export const COMMENTS_COUNT_RANGE = {
  MIN: 0,
  MAX: 30,
};

export const COMMENT_AVATARS_RANGE = {
  MIN: 1,
  MAX: 6,
};

export const COMMENTS = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!',
];
